app/admin/caderno_respostas.rb

# end
#belongs_to :usuario

filter :usuario_id, as: :select, collection: proc{ Usuario.all.pluck :email, :id }, :label => 'Selecione o Usuário'
---
SELECT "usuarios"."email", "usuarios"."id" FROM "usuarios"