app/admin/turmas.rb

SELECT "cursos".* FROM "cursos"
---

  form do |f|
  	f.inputs do
	    f.input :curso_id, as: :select, collection: Curso.all.map{|u| [u.titulo, u.id]}