app/controllers/usuarios/registrations_controller.rb

	def checa_turma

	   if Turma.exists?(codigo_turma: params[:usuario][:codigo_turma])
		   valido = true
		   @turma = Turma.find_by(codigo_turma: params[:usuario][:codigo_turma])
---
SELECT  1 AS one FROM "turmas" WHERE "turmas"."codigo_turma" = $1 LIMIT $2  [["codigo_turma", "PF01"], ["LIMIT", 1]]
SELECT  "turmas".* FROM "turmas" WHERE "turmas"."codigo_turma" = $1 LIMIT $2  [["codigo_turma", "PF01"], ["LIMIT", 1]]