app/views/caderno_respostas/_form.html.erb

SELECT  "grupos".* FROM "grupos" WHERE "grupos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "perguntas".* FROM "perguntas" WHERE "perguntas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "respostas".* FROM "respostas" WHERE "respostas"."grupo_id" = $1  [["grupo_id", 1]]
---

      <% caderno_resposta.pergunta.grupo.respostas.each do |resposta| %>