app/controllers/aulas_controller.rb

SELECT "aulas".* FROM "aulas" WHERE "aulas"."curso_id" = $1 ORDER BY "aulas"."sequencia" ASC  [["curso_id", 1]]
---
	def lista_disciplinas
		@aulas = Aula.where(curso_id: current_usuario.turma.curso.id).order(:sequencia)