app/controllers/caderno_respostas_controller.rb

  def index
    @caderno_respostas = CadernoResposta.where('usuario_id = ?',current_usuario).paginate(:page => params[:page]).order(:pergunta_id)
---
SELECT  "caderno_respostas".* FROM "caderno_respostas" WHERE (usuario_id = 1) ORDER BY "caderno_respostas"."pergunta_id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 45], ["OFFSET", 0]]