app/controllers/caderno_respostas_controller.rb

  def index

    @usuario = Usuario.find(current_usuario.id)
    @turma = Turma.find(@usuario.turma_id)

    if @turma.questionario > 0 and @turma.questionario < 8
      @offset = (@turma.questionario - 1) * 30
    else
      redirect_to aguardando_path, notice: 'Questionário ainda não está liberado.'
      return
    end

    @caderno_respostas = CadernoResposta.where('usuario_id = ?',current_usuario.id).order(:pergunta_id).page(params[:page]).limit(30).offset(@offset)

    if @caderno_respostas.count <= 0
      @perguntas = Pergunta.all
      @perguntas.each do |pergunta|
        @caderno = CadernoResposta.new(usuario_id: current_usuario.id, pergunta_id: pergunta.id)
        @caderno.save
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 ORDER BY "usuarios"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "turmas".* FROM "turmas" WHERE "turmas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "caderno_respostas".* FROM "caderno_respostas" WHERE (usuario_id = 1) ORDER BY "caderno_respostas"."pergunta_id" ASC
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "caderno_respostas" WHERE (usuario_id = 1) ORDER BY "caderno_respostas"."pergunta_id" ASC LIMIT $1 OFFSET $2) subquery_for_count  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "caderno_respostas" WHERE (usuario_id = 1) LIMIT $1 OFFSET $2) subquery_for_count  [["LIMIT", 25], ["OFFSET", 0]]
SELECT "perguntas".* FROM "perguntas"
INSERT INTO "caderno_respostas" ("usuario_id", "pergunta_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["usuario_id", 1], ["pergunta_id", 1], ["created_at", 2019-04-02 17:59:46 UTC], ["updated_at", 2019-04-02 17:59:46 UTC]]

  def update

    @usuario = Usuario.find(current_usuario.id)
    @turma = Turma.find(@usuario.turma_id)
    @questionario = @turma.questionario * 30

    respond_to do |format|

        @pergunta = @caderno_resposta.pergunta

        if @caderno_resposta.update(caderno_resposta_params)
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 ORDER BY "usuarios"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "turmas".* FROM "turmas" WHERE "turmas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "caderno_respostas" SET "resposta" = $1, "updated_at" = $2 WHERE "caderno_respostas"."id" = $3  [["resposta", 0], ["updated_at", "2020-05-08 01:05:10.437823"], ["id", 1]]

    def set_caderno_resposta
      @caderno_resposta = CadernoResposta.find(params[:id])
---
SELECT  "caderno_respostas".* FROM "caderno_respostas" WHERE "caderno_respostas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]